---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSuffix
source: html/6f59f18c-7a72-2819-3670-19f80aede525.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.RectangularDuctSizeSuffix Property

The rectangular duct size suffix string.

## Syntax (C#)
```csharp
public string RectangularDuctSizeSuffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null